[
{
    "id": 1,
    "type":"Profesional",
    "name":"A",
    "price":"100",
    "description":"Los sastres confeccionan por encargo prendas a medida cosidas a mano. También hacen arreglos a prendas como trajes y abrigos. La ropa de caballero constituye la mayor parte del sector, aunque también existe demanda de algunas prendas a medida para señora.",
    "specialties":[
        {
            "name":"Bajos pantalon",
            "price":"9"
        },
        {
            "name":"Bajos falda",
            "price":"10"
        },
        {
            "name":"cremallera",
            "price":"7"
        }
    ],
    "availability":
        ["11/05/2023","13/05/2023","20/05/2023"]
},
{
    "id": 2,
    "type":"Empresa",
    "name":"B",
    "price":"98",
    "description":"Si se acepta el presupuesto, el diseño se convierte entonces en patrón de papel o cartón, que se usa de plantilla para cortar la tela elegida. También se tienen que cortar con precisión los forros y cintas que dan forma a la ropa.",
    "specialties":[
        {
            "name":"bantalon",
            "price":"20"
        },
        {
            "name":"Americana",
            "price":"12"
        }
    ],
    "availability":
        ["12/05/2023","14/05/2023","21/05/2023"]
},
{
    "id": 3,
    "type":"Empresa",
    "name":"C",
    "price":"101",
    "description":"Los sastres son responsables de construir, alterar, reparar o modificar las prendas para los clientes según sus especificaciones, necesidades y preferencias. Toman las medidas de los clientes, ayudan en la selección de telas y organizan los ajustes para determinar si se necesitan ajustes adicionales.",
    "specialties":[
        {
            "name":"sudadera",
            "price":"20"
        },
        {
            "name":"Gabardina",
            "price":"12"
        }
    ],
    "availability":
        ["13/05/2023","15/05/2023","22/05/2023"]
},
{
    "id": 4,
    "type":"Empresa",
    "name":"D",
    "price":"101",
    "description":"Un sastre es un sastre y un vendedor con nociones de costura es un vendedor con nociones de costura. Su capacitación y experiencia difieren en la misma medida que tienen que hacer los precios que uno y otro cobran por su trabajo",
    "specialties":[
        {
            "name":"bufanda",
            "price":"20"
        },
        {
            "name":"traje",
            "price":"12"
        }
    ],
    "availability":
        ["14/05/2023","16/05/2023","23/05/2023"]
}

]